In [1]:
import pandas as pd
import json
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
from sqlalchemy.types import *
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
title_basics=pd.read_csv("title_basics.csv.gz")

In [3]:
title_basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History"
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
...,...,...,...,...,...,...,...,...,...
86778,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama
86779,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy"
86780,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama
86781,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller"
86782,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History"

In [4]:
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86783 entries, 0 to 86782
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86783 non-null  object
 1   titleType       86783 non-null  object
 2   primaryTitle    86783 non-null  object
 3   originalTitle   86783 non-null  object
 4   isAdult         86783 non-null  int64
 5   startYear       86783 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86783 non-null  int64
 8   genres          86783 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 6.0+ MB

In [5]:
title_ratings = pd.read_csv("title_ratings.csv.gz")

In [6]:
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1979
1  tt0000002            5.8       265
2  tt0000005            6.2      2621
3  tt0000006            5.1       182
4  tt0000007            5.4       821

# Normalize Genre:

Convert the single string of genres from title basics into 2 new tables.

1. title_genres: with the columns:

        a. tconst
        b. genre_id
    
2. genres
        a. genre_id
        b. genre_name

In [7]:
title_basics["genres_split"] = title_basics["genres"].str.split(',')
title_basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History","[Drama, History]"
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...,...,...,...,...
86778,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama,[Drama]
86779,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
86780,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
86781,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
86782,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"

In [8]:
exploded = title_basics.explode("genres_split")
exploded[["genres_split"]].head()

  genres_split
0       Comedy
0      Fantasy
0      Romance
1        Drama
1      History

In [9]:
unique_genres = sorted(exploded["genres_split"].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

Create a genre mapper dictionary to replace string genres with integers

In [10]:
# Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [11]:
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

# Create Tables

Replace the string genres in title_genres with the new integer ids.

In [12]:
## make new integer genre_id and drop string genres
title_basics["genre_id"] = title_basics["genres_split"].replace(genre_map)
title_basics = title_basics.drop(columns="genres_split")

Create title_genres Table

In [13]:
# Save just tconst and genres_slpit as new dataframe
title_genres = exploded[['tconst', 'genres_split']].copy()

Create genres Table

In [14]:
# Manually make dataframe with named columns from the key/value pairs
genres = pd.DataFrame({'genre_id': genre_map.values(),
                             'genre_name': genre_map.keys()})

genres.head()

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

Create tmdb_data Table

In [15]:
# Manually make a dataframe with name cols from the .key and .values
genre_lookup =pd.DataFrame({"Genre_Name": genre_id_map.keys(),"Genre_Id":genre_id_map.values()})
genre_lookup.head()

  Genre_Name  Genre_Id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [16]:
title_basics.columns

Index(['tconst', 'titleType', 'primaryTitle', 'originalTitle', 'isAdult',
       'startYear', 'endYear', 'runtimeMinutes', 'genres', 'genre_id'],
      dtype='object')

In [17]:
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86783 entries, 0 to 86782
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86783 non-null  object
 1   titleType       86783 non-null  object
 2   primaryTitle    86783 non-null  object
 3   originalTitle   86783 non-null  object
 4   isAdult         86783 non-null  int64
 5   startYear       86783 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86783 non-null  int64
 8   genres          86783 non-null  object
 9   genre_id        86783 non-null  object
dtypes: float64(1), int64(3), object(6)
memory usage: 6.6+ MB

In [18]:
save1 = ["tconst", "primaryTitle", "startYear", "genres", "runtimeMinutes"]
title_basics = title_basics[save1]
title_basics.head()

,tconst,primaryTitle,startYear,genres,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,"Comedy,Fantasy,Romance",118
1,tt0043139,Life of a Beijing Policeman,2013,"Drama,History",120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,Drama,70
3,tt0069049,The Other Side of the Wind,2018,Drama,122
4,tt0088751,The Naked Monster,2005,"Comedy,Horror,Sci-Fi",100

 Keep the imdb_id, revenue, budget, and certification columns

In [19]:
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1979
1  tt0000002            5.8       265
2  tt0000005            6.2      2621
3  tt0000006            5.1       182
4  tt0000007            5.4       821

In [20]:
tmdb_data = pd.read_csv('tmdb_results_combined.csv.gz')
tmdb_data.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
1,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,"{'id': 1131062, 'name': 'Wong Kar-Wai’s Love T...",150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.112,2221.0,PG
2,tt0119273,0.0,/f5C03doOWiauu37bToKXtpgP5bS.jpg,"{'id': 141086, 'name': 'Heavy Metal Collection...",15000000.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,16225.0,en,Heavy Metal 2000,...,0.0,88.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,not to survive the fight in the external world...,Heavy Metal 2000,0.0,6.100,181.0,R
3,tt0120263,0.0,/ynXVuylP8upazjz8lrqb1PEMkdR.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 35, 'name...",NaN,34070.0,sv,Sånger från andra våningen,...,80334.0,99.0,"[{'english_name': 'Russian', 'iso_639_1': 'ru'...",Released,NaN,Songs from the Second Floor,0.0,7.200,239.0,NaN
4,tt0120467,0.0,/knok3mNReKqPTplnnqz7E4dd7mD.jpg,NaN,120000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 27, 'name...",NaN,19085.0,en,Vulgar,...,14904.0,87.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone loves a clown... some more than others.,Vulgar,0.0,5.500,44.0,R

In [21]:
save2 = ["imdb_id","revenue","budget","certification"]
tmdb_data = tmdb_data[save2]
tmdb_data.head()

     imdb_id     revenue      budget certification
0  tt0113026         0.0  10000000.0           NaN
1  tt0118694  14204632.0    150000.0            PG
2  tt0119273         0.0  15000000.0             R
3  tt0120263     80334.0         0.0           NaN
4  tt0120467     14904.0    120000.0             R

In [22]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "nourtafa123" 
db_name = "Movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [23]:
# Create Engine
engine = create_engine(connection)

In [24]:
#create new database that didn't exist
if database_exists(connection) == False:
    create_database(connection)
    print('Database created.')
else:
    print("The database already exists.")

The database already exists.

# Save to SQL

1. Title_basics Table

In [25]:
## get max string length
max_str_len = title_basics['tconst'].fillna('').map(len).max()
max_str_len

10

In [26]:
## Calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [27]:
# Save to sql with dtype and index = False
title_basics.to_sql('title_basics', engine, dtype = df_schema, 
              if_exists = 'replace', index = False)

86783

In [28]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

2. Title_ratings Table

In [29]:
## get max string length
max_str_len = title_ratings['tconst'].fillna('').map(len).max()
max_str_len

10

In [30]:
## Calculate max string lengths for object columns
key_len = title_ratings['tconst'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Float()}

In [31]:
# Save to sql with dtype and index = False
title_ratings.to_sql('title_ratings', engine, dtype = df_schema, 
              if_exists = 'replace', index = False)

500852

In [32]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

3. Title_genres Table

In [33]:
## get max string length
max_str_len = title_genres['tconst'].fillna('').map(len).max()
max_str_len

10

In [34]:
## Calculate max string lengths for object columns
key_len = title_genres['tconst'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'genre_id':Float()}

In [35]:
# Save to sql with dtype and index = False
title_genres.to_sql('title_genres', engine, dtype = df_schema, 
              if_exists = 'replace', index = False)

162145

4. Genres Table

In [36]:
## get max string length
max_str_len = genres['genre_name'].fillna('').map(len).max()
max_str_len

10

In [37]:
## Calculate max string lengths for object columns
key_len = genres['genre_name'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "genre_name": String(key_len+1), 
    'genre_id':Float()}

In [38]:
# Save to sql with dtype and index = False
genres.to_sql('genres', engine, dtype = df_schema, 
              if_exists = 'replace', index = False)

25

5. tmdb_data Table

In [39]:
## get max string length
max_str_len = tmdb_data['imdb_id'].fillna('').map(len).max()
max_str_len

9

In [40]:
## Calculate max string lengths for object columns
key_len = tmdb_data['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": String(key_len+1), 
    "certification": Text(cert_len+1),
    'budget':Float(),
    'revenue':Float()}

In [41]:

# Save to sql with dtype and index = False
tmdb_data.to_sql('tmdb_data', engine, dtype = df_schema, 
              if_exists = 'replace', index = False)

734

In [42]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

# Show Tables in SQL

In [43]:
q = """
SELECT * 
FROM title_basics
LIMIT 5;
"""

pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,genres,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,"Comedy,Fantasy,Romance",118
1,tt0043139,Life of a Beijing Policeman,2013.0,"Drama,History",120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,Drama,70
3,tt0069049,The Other Side of the Wind,2018.0,Drama,122
4,tt0088751,The Naked Monster,2005.0,"Comedy,Horror,Sci-Fi",100

In [44]:
q = """
SELECT * 
FROM title_ratings
LIMIT 5;
"""

pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7    1979.0
1  tt0000002            5.8     265.0
2  tt0000005            6.2    2621.0
3  tt0000006            5.1     182.0
4  tt0000007            5.4     821.0

In [45]:
q = """
SELECT * 
FROM title_genres
LIMIT 5;
"""

pd.read_sql(q, engine)

      tconst genres_split
0  tt0035423       Comedy
1  tt0035423      Fantasy
2  tt0035423      Romance
3  tt0043139        Drama
4  tt0043139      History

In [46]:
q = """
SELECT * 
FROM genres
LIMIT 5;
"""

pd.read_sql(q, engine)

   genre_id genre_name
0       0.0     Action
1       1.0      Adult
2       2.0  Adventure
3       3.0  Animation
4       4.0  Biography

In [47]:
q = """
SELECT * 
FROM tmdb_data
LIMIT 5;
"""

pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0  tt0035423  76019000.0  48000000.0         PG-13
1  tt0113026         0.0  10000000.0          None
2  tt0118589   5271670.0  22000000.0         PG-13
3  tt0118652         0.0   1000000.0             R
4  tt0118694  14204600.0    150000.0            PG

In [48]:
# check with query
q = """
SHOW TABLES;
"""

pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data